config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

(global-auto-revert-mode 1)

;; Original:
;;(("TODO" warning bold)
;; ("FIXME" error bold)
;; ("HACK" font-lock-constant-face bold)
;; ("REVIEW" font-lock-keyword-face bold)
;; ("NOTE" success bold)
;; ("DEPRECATED" font-lock-doc-face bold)
;; ("BUG" error bold)
;; ("XXX" font-lock-constant-face bold))

(setq hl-todo-keyword-faces
    '(("TODO" warning bold)
      ("DONE" font-lock-doc-face bold)
      ("IMPROVE" font-lock-doc-face bold)
      ("NOTE" success bold)
      ("REVIEW" font-lock-keyword-face bold)

      ("STUB" font-lock-constant-face bold)
      ("HACK" font-lock-constant-face bold)
      ("TEMP" warning bold)
      ("FIXME" error bold)
      ("BUG" error bold)

      ("NOCOMMIT" error bold)
      ("NODEPLOY" error bold)

      ("DEPRECATED" font-lock-doc-face bold)))

;(after! hl-todo
;
;    (setq hl-todo-keyword-faces
;    '(("TODO" warning bold)
;        ("DONE" font-lock-doc-face bold)
;        ("IMPROVE" font-lock-doc-face bold)
;        ("NOTE" success bold)
;        ("REVIEW" font-lock-keyword-face bold)
;
;        ("STUB" font-lock-constant-face bold)
;        ("HACK" font-lock-constant-face bold)
;        ("TEMP" warning bold)
;        ("FIXME" error bold)
;        ("BUG" error bold)
;
;        ("NOCOMMIT" error bold)
;        ("NODEPLOY" error)
;
;        ("DEPRECATED" font-lock-doc-face bold))))
;
;(setq hl-todo-keyword-faces
;   '(("TODO" warning bold)
;     ("NOCOMMIT" error bold)
;     ("NODEPLOY" error)
;     ("DONE" font-lock-doc-face bold)
;     ("NOTE" success bold)
;     ("IMPROVE" font-lock-doc-face bold)
;     ("REVIEW" font-lock-keyword-face bold)
;
;     ("STUB" font-lock-constant-face bold)
;     ("HACK" font-lock-constant-face bold)
;     ("TEMP" warning bold)
;     ("FIXME" error bold)
;     ("BUG" error bold)
;
;     ("DEPRECATED" font-lock-doc-face bold)))

(setq svg-tag-tags
       '((":TODO:" . ((lambda (tag) (svg-tag-make "TODO" ))))))

(setq user-full-name "John Doe"
      user-mail-address "john@doe.com")

(setq display-line-numbers-type 'relative)

(map! :desc "View jumplist"
      :leader "O"
      #'+ivy/jump-list)

(defun me/insert-item-below-and-escape ()
  (interactive)
  (+org/insert-item-below 1)
  (evil-escape))

(map! :mode org-mode
      :desc "Insert below and escape"
      :nvi
      "C-S-l"
      #'me/insert-item-below-and-escape)

(defun me/insert-item-below ()
  (interactive)
  (+org/insert-item-below 1))

(map! :mode org-mode
      :desc "Insert below"
      :nvi
      "C-l"
      #'me/insert-item-below)

(defun me/insert-item-above-and-escape ()
  (interactive)
  (+org/insert-item-above 1)
  (evil-escape))

(map! :mode org-mode
      :desc "Insert above"
      :nvi
      "C-S-h"
      #'me/insert-item-above-and-escape)

(defun me/insert-item-above ()
  (interactive)
  (+org/insert-item-above 1))

(map! :mode org-mode
      :desc "Insert above"
      :nvi
      "C-h"
      #'me/insert-item-above)

(defun me/org-dwim-at-point ()
  (interactive)
  (+org/dwim-at-point 1)
  ;;(evil-escape)
  )

;; TODO Review this. Conflict with switch buffer C-k.
;;(map! :mode org-mode
;;      :desc "DWIM here"
;;      :nvi
;;      "C-k"
;;      #'me/org-dwim-at-point)

(map! :mode org-mode
      :desc "DWIM here"
      :nvi
      "C-j"
      #'me/org-dwim-at-point)

;(map! :mode org-mode
;      :desc "Insert below"
;      "S-h"
;      #'+org/insert-item-below)

(defun me/open-dir ()
  (interactive)
  (dired "."))

(map! :desc "Dired me"
      :leader "F"
      #'me/open-dir)

(map! :mode dired-mode
      :desc "Go up"
      :nv
      "h"
      #'dired-up-directory)

(map! :mode dired-mode
      :desc "Go in"
      :nv
      "l"
      #'dired-find-file)

(defun throwawayfunction ()
  ())

(use-package! olivetti)

(with-eval-after-load "olivetti"
  (with-eval-after-load "persp-mode"
    (defvar persp-olivetti-buffers-backup nil)
    (add-hook 'persp-before-deactivate-functions
              #'(lambda (fow)
                  (dolist (b (mapcar #'window-buffer
                                     (window-list (selected-frame)
                                                  'no-minibuf)))
                    (with-current-buffer b
                      (when (eq 'olivetti-split-window-sensibly
                                split-window-preferred-function)
                        (push b persp-olivetti-buffers-backup)
                        (remove-hook 'window-configuration-change-hook
                                     #'throwawayfunction t)
                        (setq-local split-window-preferred-function nil)
                        (olivetti-reset-all-windows))))))
    (add-hook 'persp-activated-functions
              #'(lambda (fow)
                  (dolist (b persp-olivetti-buffers-backup)
                    (with-current-buffer b
                      (setq-local split-window-preferred-function
                                  'olivetti-split-window-sensibly)
                      (add-hook 'window-configuration-change-hook
                                #'throwawayfunction nil t)))
                  (setq persp-olivetti-buffers-backup nil)))))

(defun me/centre-the-buffer ()
  (interactive)
  (olivetti-mode)
  (olivetti-set-width 115))

(add-hook 'display-line-numbers-mode-hook #'me/centre-the-buffer)
(add-hook 'org-mode-hook #'me/centre-the-buffer)
(add-hook 'dired-mode-hook #'me/centre-the-buffer)

(setq redisplay-dont-pause t
      scroll-margin 1
      scroll-step 1
      scroll-conservatively 1000
      scroll-preserve-screen-position 1)

(defun pt/split-window-thirds ()
  "Split a window into thirds."
  (interactive)
  (split-window-right)
  (split-window-right)
  (balance-windows))


(map! :desc "Split window into 3"
      :leader "w 3"
      #'pt/split-window-thirds)

(map! :desc "Increase height"
      :leader "w S-j"
      #'evil-window-increase-height)

(map! :desc "Decrease height"
      :leader "w S-k"
      #'evil-window-decrease-height)

(map! :desc "Increase width"
      :leader "w S-l"
      #'evil-window-increase-width)

(map! :desc "Decrease width"
      :leader "w S-h"
      #'evil-window-decrease-width)

(map! :desc "Select buffer"
      "C-k"
      #'+ivy/switch-buffer)

(map! :desc "Select buffer"
      :leader "k"
      #'+ivy/switch-buffer)

;;(+workspace/switch-to INDEX)
(map! :desc "Select tab"
      :leader "l"
      #'+workspace/switch-to)

(setq! initial-major-mode 'org-mode)
