config.org
* Colour scheme/Theme

#+begin_src elisp
;;(setq doom-theme 'my-cyber)
(setq doom-theme 'doom-one)
(setq doom-modeline-enable-word-count nil)
(setq! doom-modeline-height 26)
;; (setq display-line-numbers-type 'nil)

(setq doom-modeline-icon (display-graphic-p))

;; Whether display the icon for `major-mode'. It respects `doom-modeline-icon'.
(setq doom-modeline-major-mode-icon t)

;; Whether display the colorful icon for `major-mode'.
;; It respects `all-the-icons-color-icons'.
(setq doom-modeline-major-mode-color-icon t)

(setq doom-modeline-enable-word-count nil)

;; Whether display the workspace name. Non-nil to display in the mode-line.
(setq doom-modeline-workspace-name nil)

;; Whether display the perspective name. Non-nil to display in the mode-line.
(setq doom-modeline-persp-name t)

;; If non nil the default perspective name is displayed in the mode-line.
(setq doom-modeline-display-default-persp-name nil)

;; If non nil the perspective name is displayed alongside a folder icon.
(setq doom-modeline-persp-icon t)

;; Whether display the `lsp' state. Non-nil to display in the mode-line.
(setq doom-modeline-lsp t)


;; Opacity
;;(set-frame-parameter (selected-frame) 'alpha '(85 . 50))
;;(add-to-list 'default-frame-alist '(alpha . (85 . 50)))
#+end_src

As noted in .emacs.d/modules/ui/doom/README.org, terminal+daemon users have issues with solarie mode.

Let's fix that.

##+begin_src elisp
#(package! solaire-mode :disable t)
##+end_src

** Generally good color schemes
doom-one city-lights doom-gruvbox doom-horizon monokai-spectrum
** Great for the terminal
doom-dracula
** Great for the crt
doom-dark+ doom-nova doom-shades-of-purple
doom-homage-black
** Hard colours, but still good.
doom-laserwave outrun-electric
** Weird but good.
miramare rouge
** Ok!
moonlight palenight
** White/light
opera-light solarized-light doom-gruvbox-light

* Font settings

#+begin_src elisp
(setq doom-font
      (font-spec
         :family "Iosevka"
         ;;:family "IO Sevka"
         :size 14))
#+end_src

** Monospaced
#+begin_example elisp
(setq doom-font
      (font-spec
         :family "TerminessTTF NF"
         :size 14
         ))
#+end_example

(setq doom-font
      (font-spec
         :family "IO Sevka Medium"
         :size 14))

(setq doom-font
      (font-spec
         :family "Iosevka SS08 Regular"
         :size 15))

(setq doom-font
      (font-spec
         :family "Iosevka Regular"
         :size 15))

(setq doom-font
      (font-spec
         :family "BlexMono NF Text"
         :size 15))

(setq doom-font
      (font-spec
         :family "UbuntuMono Nerd Font Regular"
         :size 15))

(setq doom-font
      (font-spec
         :family "agave Nerd Font r"
         :size 15))

(setq doom-font
      (font-spec
         :family "FantasqueSansMono NF Regular"
         :size 15))

-- 3270Narrow Nerd Font Mono
(setq doom-font (font-spec :family "3270Narrow Nerd Font Mono" :size 20))

** Retro pixelated
+begin_src elisp
(setq doom-font
      (font-spec
         :family "GohuFont Nerd Font uni-14"
         :size 15))
+end_src

 -- GohuFont Nerd Font Mono
+begin_src elisp
(setq doom-font (font-spec :family "GohuFont Nerd Font" :size 14))
+end_src

 ==> Pixelated fonts
 -- ProggyCleanTT Nerd Font
+begin_src elisp
(setq doom-font (font-spec :family "ProggyClean TT Nerd Font" :size 15))
+end_src

 -- Undefined medium
(setq doom-font (font-spec :family "Undefined Medium" :size 15))

* Text editing things

#+begin_src elisp
(setq-default tab-width 4)
(setq tab-width 4)
#+end_src

#+begin_src elisp
(setq require-final-newline nil)
#+end_src

#+begin_src elisp
(map! :desc "Comment selected stuff"
      :nvi
      "C-_"
      #'comment-dwim)

(map! :desc "Comment selected stuff"
      :nvi
      "C-c c"
      #'comment-dwim)
#+end_src

#+RESULTS:

#+begin_src elisp
(setq fill-region 100)
#+end_src
* Default modes for some files
** Prolog .pl files.

#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.pl\\'" . prolog-mode))
#+end_src

** JavaCC .jj files.

#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.jj\\'" . java-mode))
#+end_src

** C++ .cpp/.hpp/.cc/.ccm/.cppm files
#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.hpp\\'" . cpp-mode))
(add-to-list 'auto-mode-alist '("\\.cc\\'" . cpp-mode))
(add-to-list 'auto-mode-alist '("\\.ccm\\'" . cpp-mode))
(add-to-list 'auto-mode-alist '("\\.cppm\\'" . cpp-mode))
#+end_src
** Musicalpy .lists files.

#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.lists\\'" . org-mode))
#+end_src
** Systemd service .service files

#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.service\\'" . conf-toml-mode))
#+end_src

* Folding

Enable folding everywhere

#+begin_src elisp
(vimish-fold-global-mode 1)
#+end_src

And set the marks to ~region~ ~endregion~.

#+begin_src elisp
(setq vimish-fold-marks '("region" . "endregion"))
#+end_src

* Dired
** Editable dired
See [[org:editable-dired-changing-file-permissions-in-insert-mode.org][editable dired notes.]]

#+begin_src elisp
(setq wdired-allow-to-change-permissions t)
(setq wdired-use-interactive-rename t)
(setq wdired-confirm-overwrite t)
#+end_src
* Tmux integration
** Make tmux follow terminal emacs.

#+begin_src elisp
(defun me/make-tmux-come-here-and-drop-to-shell ()
  (interactive)
  (ignore-errors (call-process "tmux" nil nil nil "respawn-pane" "-k" "-c" default-directory))
  ;(ignore-errors (call-process "tmux" nil nil nil "respawn-window" "-k" "-c" default-directory))
  ;;(+workspace/delete (+workspace-current-name))
  ;;(+workspaces-delete-associated-workspace-h)
  ;;(workspace-current-name)
  )

;;(defun me/make-tmux-come ()
;;  (interactive)
;;  (ignore-errors (call-process "tmux" nil nil nil
;;                               "respawn-window" "-k"
;;                               "-c" default-directory
;;                               "fish -C te -c fish"))
;;  )

;;(map! :desc "Make tmux come here & drop to shell."
;;      :leader "l"
;;      #'me/make-tmux-come-here-and-drop-to-shell)

;;'(add-hook 'kill-emacs-hook #'me/make-tmux-come-here-and-drop-to-shell)

(defun me/come-and-kill ()
  (interactive)
  (if (display-graphic-p) ;; TODO(akiss) do an if else, if we're in graphical, open term to replace emacs.
      (save-buffers-kill-terminal)
      (progn
        (me/make-tmux-come-here-and-drop-to-shell)
        (save-buffers-kill-terminal)
        ))
  )

;;(map! :desc "Make come, then kill."
;;      :leader "q q"
;;      #'me/come-and-kill)

(map! :desc "Make come, then kill. Quick."
      :leader "Q"
      #'me/come-and-kill)

(map! :desc "Make come, then kill. Quick."
      :leader "DEL"
      #'me/come-and-kill)
#+end_src

#+RESULTS:
: me/come-and-kill

