config.el

;;(setq doom-theme 'my-cyber)
(setq doom-theme 'doom-one)
(setq doom-modeline-enable-word-count nil)
(setq! doom-modeline-height 26)
;; (setq display-line-numbers-type 'nil)

(setq doom-modeline-icon (display-graphic-p))

;; Whether display the icon for `major-mode'. It respects `doom-modeline-icon'.
(setq doom-modeline-major-mode-icon t)

;; Whether display the colorful icon for `major-mode'.
;; It respects `all-the-icons-color-icons'.
(setq doom-modeline-major-mode-color-icon t)

(setq doom-modeline-enable-word-count nil)

;; Whether display the workspace name. Non-nil to display in the mode-line.
(setq doom-modeline-workspace-name nil)

;; Whether display the perspective name. Non-nil to display in the mode-line.
(setq doom-modeline-persp-name t)

;; If non nil the default perspective name is displayed in the mode-line.
(setq doom-modeline-display-default-persp-name nil)

;; If non nil the perspective name is displayed alongside a folder icon.
(setq doom-modeline-persp-icon t)

;; Whether display the `lsp' state. Non-nil to display in the mode-line.
(setq doom-modeline-lsp t)


;; Opacity
;;(set-frame-parameter (selected-frame) 'alpha '(85 . 50))
;;(add-to-list 'default-frame-alist '(alpha . (85 . 50)))

(setq doom-font
      (font-spec
         :family "Iosevka"
         ;;:family "IO Sevka"
         :size 14))

(setq-default tab-width 4)
(setq tab-width 4)

(setq require-final-newline nil)

(map! :desc "Comment selected stuff"
      :nvi
      "C-_"
      #'comment-dwim)

(map! :desc "Comment selected stuff"
      :nvi
      "C-c c"
      #'comment-dwim)

(setq fill-region 100)

(add-to-list 'auto-mode-alist '("\\.pl\\'" . prolog-mode))

(add-to-list 'auto-mode-alist '("\\.jj\\'" . java-mode))

(add-to-list 'auto-mode-alist '("\\.hpp\\'" . cpp-mode))
(add-to-list 'auto-mode-alist '("\\.cc\\'" . cpp-mode))
(add-to-list 'auto-mode-alist '("\\.ccm\\'" . cpp-mode))
(add-to-list 'auto-mode-alist '("\\.cppm\\'" . cpp-mode))

(add-to-list 'auto-mode-alist '("\\.lists\\'" . org-mode))

(add-to-list 'auto-mode-alist '("\\.service\\'" . conf-toml-mode))

(vimish-fold-global-mode 1)

(setq vimish-fold-marks '("region" . "endregion"))

(setq wdired-allow-to-change-permissions t)
(setq wdired-use-interactive-rename t)
(setq wdired-confirm-overwrite t)

(defun me/make-tmux-come-here-and-drop-to-shell ()
  (interactive)
  (ignore-errors (call-process "tmux" nil nil nil "respawn-pane" "-k" "-c" default-directory))
  ;(ignore-errors (call-process "tmux" nil nil nil "respawn-window" "-k" "-c" default-directory))
  ;;(+workspace/delete (+workspace-current-name))
  ;;(+workspaces-delete-associated-workspace-h)
  ;;(workspace-current-name)
  )

;;(defun me/make-tmux-come ()
;;  (interactive)
;;  (ignore-errors (call-process "tmux" nil nil nil
;;                               "respawn-window" "-k"
;;                               "-c" default-directory
;;                               "fish -C te -c fish"))
;;  )

;;(map! :desc "Make tmux come here & drop to shell."
;;      :leader "l"
;;      #'me/make-tmux-come-here-and-drop-to-shell)

;;'(add-hook 'kill-emacs-hook #'me/make-tmux-come-here-and-drop-to-shell)

(defun me/come-and-kill ()
  (interactive)
  (if (display-graphic-p) ;; TODO(akiss) do an if else, if we're in graphical, open term to replace emacs.
      (save-buffers-kill-terminal)
      (progn
        (me/make-tmux-come-here-and-drop-to-shell)
        (save-buffers-kill-terminal)
        ))
  )

;;(map! :desc "Make come, then kill."
;;      :leader "q q"
;;      #'me/come-and-kill)

(map! :desc "Make come, then kill. Quick."
      :leader "Q"
      #'me/come-and-kill)

(map! :desc "Make come, then kill. Quick."
      :leader "DEL"
      #'me/come-and-kill)
