config.org
* Org mode

TODO: Should make +org/insert-item-below (count) map to just enter in normal mode somehow.

#+begin_src elisp
;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")
;; (setq org-hide-emphasis-markers nil)
(setq org-ellipsis " ↯")

;; => Org agenda stuff.
(setq org-agenda-start-with-log-mode t)

(setq org-log-done 'time)
(setq org-log-into-drawer t)

(setq org-tag-alist
      '((:startgroup)
        ;; Mutually exclusive tags go here
        ("uni" . U)
        (:endgroup)
        ;; Non-mutually exclusives go here
        ("lecture" . L)
        ("CS257-ACA" . ACA)

        ("errand" . E)
        ("shopping" . S)
        ("idea" . I)
        ("note" . N)
        ("recurring" . R)
        ("schedule" . S)))

;; Org mode and Latex, sitting in a tree.
(setq org-latex-create-formula-image-program 'dvipng)

(after! org
  ;;(require 'org-bullets)
  (setq! initial-major-mode 'org-mode)

  ;;(map! :desc "Insert below"
  ;;      :nvi
  ;;      "C-j"
  ;;      #'+org/insert-item-below 1)

  ;;(map! :desc "Insert above"
  ;;      :nvi
  ;;      "C-k"
  ;;      #'+org/insert-item-above 1)

  ;;(map! :desc "Do what I mean"
  ;;      :nvi
  ;;      "C-l"
  ;;      #'+org/dwim-at-point)

  (map! :desc "Insert krita sketch"
        :leader "i i"
        #'org-krita-insert-new-image)

  (plist-put org-format-latex-options :scale 1.4)

  ;; (setq org-bullets-bullet-list '("▷" "○" "▱" "◇" "⭔" "⬡"))
  ;; (setq org-bullets-bullet-list '("○" "▱" "⯈" "◇" "⭔" "⬡"))
  ;;(setq org-bullets-bullet-list '("○" "▱" "⯈" "⯁" "⬟" "⭓" "⬢"))
  ;;(setq org-bullets-bullet-list '("⯈" "⯁" "⭓" "⬢"))
    ;; ("⯈" "⯁" "⭓" "⬢")

    ;; -> Org habit
    (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)

  ;; -> Shift Enter to open new
  (evil-define-key 'normal evil-normal-state-map
    (kbd "S-<return>")
    '+org/insert-item-below)


  ;; -> Org capture
  (setq org-capture-templates
      '(("i" "Ideas")
         ("ii" "Idea" entry
                (file+olp "~/org/ideas.org" "Inbox")
                ;; Quick explanation of the pattern here:
                ;; %? -> Where the cursor gets placed, e.g. where the text goes
                ;; %U -> Timestamp of when it was created
                ;; %a -> a(ddress) in emacs of where this was made from
                ;; or %i...
                "* IDEA %?\n %U\n %a\n %i"
                :empty-lines 1)

        ("t" "Tasks/Projects")
          ("tt" "Task" entry
                (file+olp "~/org/tasks.org" "Inbox")
                "* TODO %?\n %U\n %a\n %i"
                :empty-lines 1)
          ("ts" "Clocked Subtask" entry
                (clock)
                "* TODO %?\n %U\n %a\n %i"
                :empty-lines 1)

        ("j" "Journal")
          ("jj" "Journal" entry
                (file+olp+datetree "~/org/journal.org")
                "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
                :empty-lines 1)


        ("s" "Schedule")
          ("ss" "Task" entry
                (file+olp "~/org/schedule.org" "Inbox")
                "* TODO %?\n %U\n %a\n %i"
                :empty-lines 1)

        ("m" "Metrics")
          ("mw" "Weight" table-line
                (file+headline "~/org/metrics.org" "Weight")
                "| %U | %^{Weight} | %^{Notes} |"
                :kill-buffer t)))

  (setq org-agenda-files '("~/org/" "~/Uni/y2"))
  ;;(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  )
#+end_src

#+begin_src elisp
(use-package! org-krita
  :config
  (add-hook 'org-mode-hook 'org-krita-mode))
#+end_src

#+begin_src elisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((prolog . t)))
#+end_src

* Language specifics

**  C++

#+begin_src elisp
(add-hook `c++-mode-hook 'lsp)

(map! :map c++-mode-map
      :desc "Switch to other file"
      :leader "c O"
      #'lsp-clangd-find-other-file)
#+end_src

**  C

#+begin_src elisp
(add-hook `c-mode-hook 'lsp)

(map! :map c-mode
      :desc "Switch to other file"
      :leader "c O"
      #'lsp-clangd-find-other-file)
#+end_src
* Convenient development - compilation and building

#+begin_src elisp
(defun me/project-compile-with-ivy ()
  (interactive)
  (+ivy/project-compile))

(map! :desc "Compile project"
      :leader "c c"
      #'me/project-compile-with-ivy)
#+end_src

* Shell bindings

#+begin_src elisp
(map! :leader "o e" #'eshell)
#+end_src

* Presentations

#+begin_src elisp
(setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")
#+end_src
